#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/namitjagtiani/gh-actions-demo/runs/run-19srRYmPPKqvsPs6

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_ddos_protection_plan.ddos-plan will be created
  + resource "azurerm_network_ddos_protection_plan" "ddos-plan" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "ddospplan1"
      + resource_group_name = "wus-vnet"
      + virtual_network_ids = (known after apply)
    }

  # azurerm_network_security_group.wus-nsg will be created
  + resource "azurerm_network_security_group" "wus-nsg" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "NSGS1"
      + resource_group_name = "wus-vnet"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.wus-rg will be created
  + resource "azurerm_resource_group" "wus-rg" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "wus-vnet"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus"
      + name                  = "virtualNetwork1"
      + resource_group_name   = "wus-vnet"
      + subnet                = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.3.0/24"
              + id             = (known after apply)
              + name           = "subnet3"
              + security_group = (known after apply)
            },
        ]
      + tags                  = {
          + "environment" = "Production"
        }
      + vm_protection_enabled = false

      + ddos_protection_plan {
          + enable = false
          + id     = (known after apply)
        }
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @namitjagtiani, Action: `pull_request`*